{"title":"Slingshots and IUDs","date":1350846000000,"text":"Dear Family and Friends -\n\nHow do you say, \"good-bye?\"\n\n\"Hi, Mom.  Hi, Dad.\"\n\"Hi, Reedy.  Can you hear me O.K.?\"\n\"Yes, Mom, I can hear you.\"\n\"Hey, I've been thinking about this great idea to safely detect IUDs and...\"\n\"Mom.  They're IEDs.  E.....E.....E......There isn't any \"U\"  anywhere in I...E...D....,Mom.\"\n\".....yeah, right.  I thought this was really cool.  You know how soldiers have a dangerous and difficult time blowing them up, right?  Well, what if you used a sling shot to....\"\n\"Mom.\"\n\"....detonate them?  All the soldiers would have to do is shoot the rock from a sling shot, hit the \"IUD\", and the thing would explode.  Now, there're a bunch of really cool things about...\"\n\"Mom.\"\n\"......this.  First of all there isn't any shortage of rocks over there so the supply would be endless and the cost nonexistent.  Second, the sling shots would be very inexpensive.  In fact, I would....\"\n\"Mom.  This is the Army, Mom, and....\"\n\"...even buy them for your platoon or company or whatever your group of guys is called.  And third, one of the biggest problems that I see is boredom. You could organize teams, like shirts and skins, to make it a competition.  The guys....\"\n\"Mom!\"\n\"....would really get into this.  They would, of course, have to practice a little but they have a lot of time on their hands anyway.  Of course there is....\"\n\"Mom?\"\n\"...another benefit, too.  If they happened to come across an Afghan they would be able to take him out with their sling shot and since the sling shots don't make any noise, the Afghans wouldn't know where they were coming from and the others in their group wouldn't know what was........\"\n\"Mom?\"\n\"....happening so it would be a complete surprise.  So, I was thinking I could present this to your Battalion Commander; I'm sure he'll think it's a great....\"\n\"MOM!\"\n\"...idea.  I've bought a sling shot and a bag of stones and I've been practicing at home.  Isn't that a cool idea?  What's your Battalion Commander's name?  I would like to get this to him right away, before you guys leave for......\"\n\"MOM!  This conversation is over.  I have to go...\"\n\"...Afghanistan.\"\n\"Bye, Mom.  Love ya.\"\nClick.\n\nWhat do you say to someone who is going away for nearly a year?\n\nHow did you celebrate September 14?  No, not Tuesday, September 11; Friday, September 14.  That's Boxer Rebellion Day.  It seems that Reed's Battalion, during the Boxer Rebellion in China during the turn of the 20th century, marched 85 miles over 3 days to help liberate Americans and other foreigners in the British compound surrounded by Boxers and Chinese troops, thus earning the Battalion the nickname \"The Manchus.\"  Now they celebrate that day by marching 25 miles with 40 pound packs and their M-4s, beginning at 9:30 p.m. and finishing the following morning at 7:30 a.m.  If you are interested in participating next year, sign up now to save your spot.  (There were twenty civilians this year.)  One minor suggestion: You might want to do some training for it since Reed didn't do any and his feet at the conclusion looked like mashed potatoes with a heavy concentration of ketchup.  Perhaps if he spent more time developing the muscle between his ears than the muscles below his neck, the rest of his body would be better off.    \n\nWhat do you say to someone who is leaving?\n\n Reed has begun the final count down for his departure to Afghanistan.  This is where they review the tough stuff, just like they did when he went to Iraq.  Physical and dental check ups.  Base line brain scans for measuring potential injuries from a concussion. Where's his car?  Where are the keys?  What mail will he have forwarded?  Life insurance beneficiary?  Current will?  Power of attorney?  Living will?  Family contact information?  Shipping address for the body?  (No P. O. Boxes, please.)  Oh-blah-dee, oh-blah-dah, how blasé.  We've done this before. \n\nHow do you part ways?\n\nWe went to see Reed at the end of September.  Alden, Raechel (Alden's girlfriend), and Walker joined us with Reed and his girlfriend Ashley.  While we had a great time, wandering around Seattle and Tacoma, going to a huge fair, enjoying all kinds of meals together including a barbecue, spiced with laughter, humor, and childhood stories, there was that deployment cloud. \n\nHow do you walk away? \n\nUsually when people are leaving there's a \"going away\" gift.  So what does Reed get?  First, his pay is tax free while he's in a combat zone.  Second, he receives hostile fire pay.  Third, he receives his basic housing allowance.  And, of course, his food and housing, such as it is, are free.  Add it all up and he hits a jackpot that could come to $50,000.  What's the  value of that windfall?  Are you interested?\n\nWhat words are there for the departing?\n\nWhat's the other side of the equation?  Every day is a work day. Today is like tomorrow is like yesterday.  Every day, all 270 of them, plus some. How would you like to wake up every morning to see your arsenal staring you in the face?  Would you want to begin your workday strapping on your M-4, then holstering your sidearm, and sheathing your knife?  He'll be working on Thanksgiving, Christmas, Easter, on his birthday, and even on my birthday! Every day.  How does that bonanza look now?  Still interested?\n\nHow do you express your feelings about separation?\n\n Remember how the weekend is something special, something to look forward to?  Two days of errands, movies, pizza, golf, football, dinner out, and all those other activities that we pursue in our free time?  He'll be stuck on his FOB (forward operating base).  Order out for pizza?  Not possible.  Go to town for a movie?  Outside the wire?  To the village?  Only if you're nuts, have a death wish, or are planning to take out 16 villagers in their sleep the way that deranged soldier did a year ago.  There's no place to go. There's little to do.  Kick back with a beer, or two?  With everyone walking around with a loaded M-4?  Are you out of your mind?   Flirt with some females?  There aren't any.  This is a combat unit.  This is a \"no-sex\" zone.  Perhaps these soldiers have more in common with Islam than we thought.  No women, no dancing, no liquor.  Maybe they should talk to Abdul, Yasuf and Din.  Still looking at that pot of gold?  Still interested?  How much is your life worth?\n\nWhat does \"good-bye\" mean anyway?\n\n How do you say good-bye?  Where are the words for someone who is leaving?  Where is the script written?  What do you say?  Good-bye?  So long?  Farewell?  See you when you return?  Take care?  Be safe?  Be good?  Keep your eyes open and your head down?  \n\nWhat DO you say? God bless you?  You'll be in our prayers?  Godspeed?   \n \nWhat should I say?..........What could I say?............What did I say?................ I put my hands on his shoulders, looked him in the eye, and said, \"Reed, I love you very much.  And Mom and I will always love you, unconditionally, regardless of what happens.  But remember that every night, no matter what happens during the day, you still need to floss.\"\n\nReed leaves October 31."}